configuration/src/Catalogs/КафкаШины/КафкаШины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаШины</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.КафкаКластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Топик Кафки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСердес</name>
    <type>
      <types>EnumRef.КафкаСердес</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСердес</name>
    <type>
      <types>EnumRef.КафкаСердес</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДлительностьСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменКоличествоПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменНаправление</name>
    <type>
      <types>EnumRef.КафкаНаправленияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменРасписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменРасписаниеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменРасписаниеРазброс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентТаймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемПроцедура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемВРеальномВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемТаймаутОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРеглЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительОбъект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОбъект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КафкаКонфигурация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/КафкаНаправленияОбмена/КафкаНаправленияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КафкаНаправленияОбмена</name>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/КафкаШины/ManagerModule.bsl
// Copyright 2025 Сергей Савельев (serge@savel.pro)
//
// Лицензировано согласно Лицензии Apache, Версия 2.0 ("Лицензия");
// вы можете использовать этот файл только в соответствии с Лицензией.
// Вы можете найти копию Лицензии по адресу
//
// http://www.apache.org/licenses/LICENSE-2.0.
//
// За исключением случаев, когда это регламентировано существующим
// законодательством, или если это не оговорено в письменном соглашении,
// программное обеспечение, распространяемое на условиях данной Лицензии,
// предоставляется "КАК ЕСТЬ", и любые явные или неявные ГАРАНТИИ ОТВЕРГАЮТСЯ.
// Информацию об основных правах и ограничениях, применяемых к определенному
// языку согласно Лицензии, вы можете найти в данной Лицензии.

#Область Основная

Функция ОбменРасписаниеПоУмолчанию() Экспорт
	
	ОбменРасписание = Новый РасписаниеРегламентногоЗадания();
	ОбменРасписание.ПериодПовтораДней = 1;
	ОбменРасписание.ПериодПовтораВТечениеДня = 300;
	
	Возврат ОбменРасписание;
	
КонецФункции

Процедура ВыполнитьОбмен(ШинаСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШиныОбмена.Ссылка КАК Ссылка,
	|	ШиныОбмена.ОбменПоРасписанию КАК ОбменПоРасписанию,
	|	ШиныОбмена.ОбменНаправление КАК ОбменНаправление
	|ИЗ
	|	Справочник.КафкаШины КАК ШиныОбмена
	|ГДЕ
	|	ШиныОбмена.Ссылка = &Ссылка
	|	И НЕ ШиныОбмена.ЭтоГруппа");
	Запрос.УстановитьПараметр("Ссылка", ШинаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Передан некорректный параметр.";
	КонецЕсли;
	
	Шина = РезультатЗапроса.Выгрузить()[0];
	
	Если Шина.ОбменПоРасписанию Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.УстановитьДанные(Шина.Ссылка);
		Сообщение.Поле = "ОбменПоРасписанию";
		Сообщение.Текст = "Перед ручным запуском обмен по расписанию должен быть выключен.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Шина.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Загрузка Тогда
		КафкаВызовСервера.Загрузить(Шина.Ссылка);
	ИначеЕсли Шина.ОбменНаправление = Перечисления.КафкаНаправленияОбмена.Выгрузка Тогда
		КафкаВызовСервера.Выгрузить(Шина.Ссылка);
	Иначе
		ВызватьИсключение "Некорректное направление обмена шины: """+Шина.ОбменНаправление+""".";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
